torvalds/linux/drivers/net/wireless/rtl8723as/core/rtw_mlme_ext.c
	}

#ifdef CONFIG_WFD
	wfdielen = build_probe_req_wfd_ie(pwdinfo, pframe);
	pframe += wfdielen;
	pattrib->pktlen += wfdielen;
#endif //CONFIG_WFD	

	pattrib->last_txcmdsz = pattrib->pktlen;

	RT_TRACE(_module_rtl871x_mlme_c_,_drv_info_,("issuing probe_req, tx_len=%d\n", pattrib->last_txcmdsz));

	dump_mgntframe(padapter, pmgntframe);

	return;
}

#endif //CONFIG_P2P

unsigned int OnAction_public(_adapter *padapter, union recv_frame *precv_frame)
{
	unsigned char		*frame_body;
	unsigned char		category, action;
	u8 *pframe = precv_frame->u.hdr.rx_data;
	uint len = precv_frame->u.hdr.len;	
#ifdef CONFIG_P2P
	u8 *p2p_ie;
	u32	p2p_ielen, wps_ielen;
	struct	wifidirect_info	*pwdinfo = &( padapter->wdinfo );
	u8	result = P2P_STATUS_SUCCESS;
	u8	empty_addr[ETH_ALEN] = { 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 };
#endif //CONFIG_P2P
	struct mlme_ext_priv	*pmlmeext = &(padapter->mlmeextpriv);

	u16 seq_ctrl = ( (precv_frame->u.hdr.attrib.seq_num&0xffff) << 4) |
		(precv_frame->u.hdr.attrib.frag_num & 0xf);

	//check RA matches or not
	if (!_rtw_memcmp(myid(&(padapter->eeprompriv)), GetAddr1Ptr(pframe), ETH_ALEN))//for if1, sta/ap mode
		return _SUCCESS;


	//recv_decache check
	if(GetRetry(pframe))
	{
		if(seq_ctrl == pmlmeext->action_public_rxseq)
		{
			DBG_871X("recv_Action_public_decache, seq_ctrl=0x%x, rxseq=0x%x\n", seq_ctrl, pmlmeext->action_public_rxseq);

			return _FAIL;
		}
	}
	pmlmeext->action_public_rxseq = seq_ctrl;


	frame_body = (unsigned char *)(pframe + sizeof(struct rtw_ieee80211_hdr_3addr));

	category = frame_body[0];
	if(category != RTW_WLAN_CATEGORY_PUBLIC)
		return _SUCCESS;

	action = frame_body[ 1 ];
	if ( action == ACT_PUBLIC_P2P )	//	IEEE 802.11 P2P Public Action usage.
	{		
#ifdef CONFIG_P2P
		//	Do nothing if the driver doesn't enable the P2P function.
#ifndef CONFIG_IOCTL_CFG80211
		if(rtw_p2p_chk_state(pwdinfo, P2P_STATE_NONE) || rtw_p2p_chk_state(pwdinfo, P2P_STATE_IDLE))
			return _SUCCESS;
#endif //CONFIG_IOCTL_CFG80211
		
		//	Commented by Albert 20100908
		//	Low byte -> High byte is 0x50, 0x6F, 0x9A, 0x09 for P2P OUI.
		//	But the P2POUT is defined as 0x506F9A09 -> should use the cpu_to_be32
		if ( cpu_to_be32( *( ( u32* ) ( frame_body + 2 ) ) ) == P2POUI )
		{
#ifdef CONFIG_IOCTL_CFG80211
			if(wdev_to_priv(padapter->rtw_wdev)->p2p_enabled)
			{
				rtw_cfg80211_rx_p2p_action_public(padapter, pframe, len);
			}
			else
#endif //CONFIG_IOCTL_CFG80211
			{
				switch( frame_body[ 6 ] )//OUI Subtype
				{
					case P2P_GO_NEGO_REQ:
					{
						DBG_871X( "[%s] Got GO Nego Req Frame\n", __FUNCTION__);
						_rtw_memset( &pwdinfo->groupid_info, 0x00, sizeof( struct group_id_info ) );
						
						if(rtw_p2p_chk_state(pwdinfo, P2P_STATE_GONEGO_FAIL))
						{
							//	Commented by Albert 20110526
							//	In this case, this means the previous nego fail doesn't be reset yet.
							_cancel_timer_ex( &pwdinfo->restore_p2p_state_timer );
							//	Restore the previous p2p state
							rtw_p2p_set_state(pwdinfo, rtw_p2p_pre_state(pwdinfo));
							DBG_871X( "[%s] Restore the previous p2p state to %d\n", __FUNCTION__, rtw_p2p_state(pwdinfo) );						
						}					

						//	Commented by Kurt 20110902
						//Add if statement to avoid receiving duplicate prov disc req. such that pre_p2p_state would be covered.
						if(!rtw_p2p_chk_state(pwdinfo, P2P_STATE_GONEGO_ING))
							rtw_p2p_set_pre_state(pwdinfo, rtw_p2p_state(pwdinfo));

						//	Commented by Kurt 20120113
						//	Get peer_dev_addr here if peer doesn't issue prov_disc frame.
						if( _rtw_memcmp(pwdinfo->rx_prov_disc_info.peerDevAddr, empty_addr, ETH_ALEN) );
							_rtw_memcpy(pwdinfo->rx_prov_disc_info.peerDevAddr, GetAddr2Ptr(pframe), ETH_ALEN);

						result = process_p2p_group_negotation_req( pwdinfo, frame_body, len );
						issue_p2p_GO_response( padapter, GetAddr2Ptr(pframe), frame_body, len, result );
						//	Commented by Albert 20110718
						//	No matter negotiating or negotiation failure, the driver should set up the restore P2P state timer.
						_set_timer( &pwdinfo->restore_p2p_state_timer, 5000 );
						break;					
					}
					case P2P_GO_NEGO_RESP:
					{
						DBG_871X( "[%s] Got GO Nego Resp Frame\n", __FUNCTION__);
	
						if(rtw_p2p_chk_state(pwdinfo, P2P_STATE_GONEGO_ING))
						{
							//	Commented by Albert 20110425
							//	The restore timer is enabled when issuing the nego request frame of rtw_p2p_connect function.
							_cancel_timer_ex( &pwdinfo->restore_p2p_state_timer );
							result = process_p2p_group_negotation_resp( pwdinfo, frame_body, len);
	
							issue_p2p_GO_confirm( pwdinfo->padapter, GetAddr2Ptr(pframe), result);

							//	Reset the dialog token for group negotiation frames.
							pwdinfo->negotiation_dialog_token = 1;

							if(rtw_p2p_chk_state(pwdinfo, P2P_STATE_GONEGO_FAIL))
							{
								_set_timer( &pwdinfo->restore_p2p_state_timer, 5000 );
							}
						}
						else
						{
							DBG_871X( "[%s] Skipped GO Nego Resp Frame (p2p_state != P2P_STATE_GONEGO_ING)\n", __FUNCTION__);
						}
						
						break;
					}
					case P2P_GO_NEGO_CONF:
					{
						DBG_871X( "[%s] Got GO Nego Confirm Frame\n", __FUNCTION__);
						process_p2p_group_negotation_confirm( pwdinfo, frame_body, len);
						break;
					}
					case P2P_INVIT_REQ:
					{
						//	Added by Albert 2010/10/05
						//	Received the P2P Invite Request frame.
						
						DBG_871X( "[%s] Got invite request frame!\n", __FUNCTION__ );
						if ( (p2p_ie=rtw_get_p2p_ie( frame_body + _PUBLIC_ACTION_IE_OFFSET_, len - _PUBLIC_ACTION_IE_OFFSET_, NULL, &p2p_ielen)) )
						{
							//	Parse the necessary information from the P2P Invitation Request frame.
							//	For example: The MAC address of sending this P2P Invitation Request frame.
							u8	groupid[ 38 ] = { 0x00 };
							u32	attr_contentlen = 0;
							u8	match_result = 0;						

							rtw_get_p2p_attr_content( p2p_ie, p2p_ielen, P2P_ATTR_GROUP_ID, groupid, &attr_contentlen);
							_rtw_memcpy( pwdinfo->p2p_peer_interface_addr, groupid, ETH_ALEN );
							rtw_p2p_set_state(pwdinfo, P2P_STATE_RECV_INVITE_REQ);
							DBG_871X( "[%s] peer address %.2X %.2X %.2X %.2X %.2X %.2X\n", __FUNCTION__,
									groupid[0], groupid[1], groupid[2], groupid[3], groupid[4], groupid[5] );

